In [ ]:
# структурированные данные
['vasy', 'pety']
{
    'name': 'Alex',
    'year': 2000
}

[
    {
      'name': 'Alex',
      'year': 2000  
    },
    {
       'name': 'Vity',
       'year': 1998
    },
]

Релязонные базы данных

In [ ]:
#  SQL 
Создание тбалиц 
create table
Модификация записей в таблице
update
Удаление записей из ьаблицы
delete
выборка записей из таблиц
select

In [1]:
import sqlite3

try:
    sqlite_connection = sqlite3.connect('sqlite_python.db')
    cursor = sqlite_connection.cursor()
    print("База данных создана и успешно подключена к SQLite")

    sqlite_select_query = "select sqlite_version();"
    cursor.execute(sqlite_select_query)
    record = cursor.fetchall()
    print("Версия базы данных SQLite: ", record)
    cursor.close()

except sqlite3.Error as error:
    print("Ошибка при подключении к sqlite", error)
finally:
    if (sqlite_connection):
        sqlite_connection.close()
        print("Соединение с SQLite закрыто")

База данных создана и успешно подключена к SQLite
Версия базы данных SQLite:  [('3.36.0',)]
Соединение с SQLite закрыто

In [2]:
import sqlite3

In [3]:
sqlite_connection = sqlite3.connect('db/sqlite_python.db')
cursor = sqlite_connection.cursor()
print("База данных создана и успешно подключена к SQLite")

База данных создана и успешно подключена к SQLite

In [5]:
#  теефорнный спправочник
# имя, грод, дата рожения, телефон
int, str

sql_create_table = "create table Phone_Book(name varchar(20), city varchar(10), year date, phone_number  varchar(15))"
cursor.execute(sql_create_table)

In [6]:
cursor.fetchall()

[]

In [11]:
cursor.execute("schema")
cursor.fetchall()

OperationalError: near "schema": syntax error

In [12]:
cursor.execute("select * from Phone_Book")
cursor.fetchall()

[]

In [13]:
cursor.execute("insert into Phone_Book(name, city, year, phone_number) values('Alex', 'Moscow', '2000-01-01', '89165554433')")
cursor.fetchall()

[]

In [14]:
cursor.execute("select * from Phone_Book")
cursor.fetchall()

[('Alex', 'Moscow', '2000-01-01', '89165554433')]

In [15]:
cursor.execute("insert into Phone_Book(name, city, year, phone_number) values('Vasy', 'Moscow', '1999-11-22', '89165551234')")
cursor.fetchall()

[]

In [16]:
cursor.execute("insert into Phone_Book(name, city, year, phone_number) values('Mike', 'SPB', '1998-01-02', '89165551235')")
cursor.fetchall()

[]

In [4]:
cursor.execute("select * from Phone_Book")
cursor.fetchall()

[('Alex', 'Moscow', '2000-01-01', '89165554433'),
 ('Vasy', 'Moscow', '1999-11-22', '89165551234'),
 ('Mike', 'SPB', '1998-01-02', '89165551235')]

In [18]:
sqlite_connection.commit()

In [5]:
cursor.execute("select * from Phone_Book where city = 'Moscow'")
cursor.fetchall()

[('Alex', 'Moscow', '2000-01-01', '89165554433'),
 ('Vasy', 'Moscow', '1999-11-22', '89165551234')]

In [6]:
cursor.execute("select * from Phone_Book where city like 'Mos%'")
cursor.fetchall()

[('Alex', 'Moscow', '2000-01-01', '89165554433'),
 ('Vasy', 'Moscow', '1999-11-22', '89165551234')]

In [7]:
cursor.execute("select name, year from Phone_Book where city like 'Mos%'")
cursor.fetchall()

[('Alex', '2000-01-01'), ('Vasy', '1999-11-22')]

In [8]:
cursor.execute("select count(*)  from Phone_Book where city like 'Mos%'")
cursor.fetchall()

[(2,)]

In [12]:
cursor.execute("select name, year from Phone_Book where city like 'Mos%' order by name asc")
cursor.fetchall()

[('Alex', '2000-01-01'), ('Vasy', '1999-11-22')]

In [13]:
cursor.execute("select name, year from Phone_Book where city like 'Mos%' order by name desc")
cursor.fetchall()

[('Vasy', '1999-11-22'), ('Alex', '2000-01-01')]

In [14]:
cursor.execute("select name, year from Phone_Book where city like 'Mos%' order by name desc limit 1")
cursor.fetchall()

[('Vasy', '1999-11-22')]

In [15]:
cursor.execute("select name, year from Phone_Book where city like 'Mos%' order by name desc limit 1, 2")
cursor.fetchall()

[('Alex', '2000-01-01')]

In [16]:
cursor.execute("select name, year from Phone_Book order by name desc limit 1, 1")
cursor.fetchall()

[('Mike', '1998-01-02')]

In [ ]:
cursor.execute("alter table Phone_Book add income ")
cursor.fetchall()

#HW 
- Реализовать на python базу данных по персоналу с двумя таблицами из занятия.
- Заполнить ее данными.
- Написать select который вернет таблицу содержащую названия отделов, среднюю зарплату в отдел, отсортированных по убыванию средне зп.
- Добавить в первый отдел еще одно сотрудника с ЗП 1000 и посмотреть как изменится результат.

In [1]:
import sqlite3
sqlite_connection = sqlite3.connect('db/sqlite_python.db')
cursor = sqlite_connection.cursor()
print("База данных создана и успешно подключена к SQLite")

База данных создана и успешно подключена к SQLite

In [2]:
#cursor.execute("select name, year from Phone_Book order by name desc limit 1, 1")

In [3]:
	Сотрудники	employees		
id	name	surename	department_id	salary
1	Иван	Иванов	1	5000
2	Света	Сидорова	1	4500
3	Илья	Макаров	2	4500
4	Марина	Федорова	2	6000
5	Вадим	Ильин	3	7000
6	Илья	Филатов	4	5500
7	Марина	Сидорова	2	9000
8	Вадим	Ильин	3	7000

SyntaxError: invalid syntax (4068654095.py, line 1)

In [4]:
	Отделы	department
id	name	
1	Маркетинг	
2	Продажи	
3	Бухгалтерия	
4

SyntaxError: invalid syntax (1395909487.py, line 1)

In [5]:
sql_create_table = "create table Employees(id INTEGER, name varchar(20), surename varchar(20), department_id INTEGER, salary INTEGER)"
cursor.execute(sql_create_table)

In [6]:
cursor.execute("insert into Employees(id, name, surename, department_id, salary) values(1, 'Иван', 'Иванов', 1, 5000)")
cursor.fetchall()

[]

In [7]:
cursor.execute("select name, surename from Employees")
cursor.fetchall()

[('Иван', 'Иванов')]

In [8]:
cursor.execute("insert into Employees(id, name, surename, department_id, salary) values(2, 'Света', 'Сидорова', 1, 4500)")
cursor.fetchall()

[]

In [9]:
cursor.execute("select name, surename from Employees")
cursor.fetchall()

[('Иван', 'Иванов'), ('Света', 'Сидорова')]

In [10]:
cursor.execute("""
    insert into Employees(id, name, surename, department_id, salary) 
        values
        (3, 'Илья', 'Макаров', 2, 4500),
        (4, 'Марина', 'Федорова', 2, 6000),
        (5, 'Вадим', 'Ильин', 3, 7000),
        (6, 'Илья', 'Филатов', 4, 5500)
""")
cursor.fetchall()

[]

In [11]:
cursor.execute("select * from Employees")
cursor.fetchall()

[(1, 'Иван', 'Иванов', 1, 5000),
 (2, 'Света', 'Сидорова', 1, 4500),
 (3, 'Илья', 'Макаров', 2, 4500),
 (4, 'Марина', 'Федорова', 2, 6000),
 (5, 'Вадим', 'Ильин', 3, 7000),
 (6, 'Илья', 'Филатов', 4, 5500)]

In [12]:
# надо заполнить таблицу с отделами

In [14]:
cursor.execute("create table Departments(id INTEGER, name varchar(30))")
cursor.fetchall()

[]

In [15]:
cursor.execute("insert into Departments(id, name) values(1,'Маркетинг')")

In [16]:
cursor.execute("select * from Departments")

In [17]:
cursor.fetchall()

[(1, 'Маркетинг')]

In [19]:
cursor.execute("insert into Departments(id, name) values(2,'Продажи')")
cursor.execute("insert into Departments(id, name) values(3,'Бухгалтерия')")

In [21]:
cursor.execute("select * from Departments")
cursor.fetchall()

[(1, 'Маркетинг'), (2, 'Продажи'), (3, 'Бухгалтерия')]

In [23]:
# как вывести имена всех пользователей ЗП которых больше 5500

In [27]:
cursor.execute("select name, salary from Employees where salary >= 5500")
cursor.fetchall()

[('Марина', 6000), ('Вадим', 7000), ('Илья', 5500)]

In [28]:
cursor.execute("select * from Employees where name like 'Ил%'")
cursor.fetchall()

[(3, 'Илья', 'Макаров', 2, 4500), (6, 'Илья', 'Филатов', 4, 5500)]

In [31]:
cursor.execute("select * from Employees where name = 'Илья'")
cursor.fetchall()

[(3, 'Илья', 'Макаров', 2, 4500), (6, 'Илья', 'Филатов', 4, 5500)]

In [34]:
cursor.execute("select * from Employees where name like '%а%'")
cursor.fetchall()

[(1, 'Иван', 'Иванов', 1, 5000),
 (2, 'Света', 'Сидорова', 1, 4500),
 (4, 'Марина', 'Федорова', 2, 6000),
 (5, 'Вадим', 'Ильин', 3, 7000)]

In [38]:
cursor.execute("select count(*) from Employees where name = 'Илья'")
cursor.fetchall()

[(2,)]

In [39]:
cursor.execute("select sum(salary) from Employees")
cursor.fetchall()

[(32500,)]

In [41]:
cursor.execute("select avg(salary) from Employees")
cursor.fetchall()

[(5416.666666666667,)]

In [42]:
cursor.execute("select avg(salary) from Employees where name = 'Илья'")
cursor.fetchall()

[(5000.0,)]

In [44]:
cursor.execute("select * from Employees where name = 'Илья'")
cursor.fetchall()

[(3, 'Илья', 'Макаров', 2, 4500), (6, 'Илья', 'Филатов', 4, 5500)]

In [45]:
cursor.execute("alter table Employees add city varchar(15)")

In [46]:
cursor.execute("select * from Employees")
cursor.fetchall()

[(1, 'Иван', 'Иванов', 1, 5000, None),
 (2, 'Света', 'Сидорова', 1, 4500, None),
 (3, 'Илья', 'Макаров', 2, 4500, None),
 (4, 'Марина', 'Федорова', 2, 6000, None),
 (5, 'Вадим', 'Ильин', 3, 7000, None),
 (6, 'Илья', 'Филатов', 4, 5500, None)]

In [49]:
cursor.execute("update Employees set city = 'Moscow' where id = 1")

In [50]:
cursor.execute("select * from Employees")
cursor.fetchall()

[(1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (2, 'Света', 'Сидорова', 1, 4500, None),
 (3, 'Илья', 'Макаров', 2, 4500, None),
 (4, 'Марина', 'Федорова', 2, 6000, None),
 (5, 'Вадим', 'Ильин', 3, 7000, None),
 (6, 'Илья', 'Филатов', 4, 5500, None)]

In [51]:
cursor.execute("update Employees set city = 'Moscow1234567890Moscow' where id = 2")

In [52]:
cursor.execute("select * from Employees")
cursor.fetchall()

[(1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (3, 'Илья', 'Макаров', 2, 4500, None),
 (4, 'Марина', 'Федорова', 2, 6000, None),
 (5, 'Вадим', 'Ильин', 3, 7000, None),
 (6, 'Илья', 'Филатов', 4, 5500, None)]

In [53]:
sqlite_connection.commit()

In [2]:
cursor.execute("select * from Employees")
cursor.fetchall()

[(1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (3, 'Илья', 'Макаров', 2, 4500, None),
 (4, 'Марина', 'Федорова', 2, 6000, None),
 (5, 'Вадим', 'Ильин', 3, 7000, None),
 (6, 'Илья', 'Филатов', 4, 5500, None)]

In [3]:
# отсортровать по фаилилиям
cursor.execute("select * from Employees order by surename asc")
cursor.fetchall()

[(1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (5, 'Вадим', 'Ильин', 3, 7000, None),
 (3, 'Илья', 'Макаров', 2, 4500, None),
 (2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (4, 'Марина', 'Федорова', 2, 6000, None),
 (6, 'Илья', 'Филатов', 4, 5500, None)]

In [4]:
# отсортровать по фаилили убывание
cursor.execute("select * from Employees order by surename desc")
cursor.fetchall()

[(6, 'Илья', 'Филатов', 4, 5500, None),
 (4, 'Марина', 'Федорова', 2, 6000, None),
 (2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (3, 'Илья', 'Макаров', 2, 4500, None),
 (5, 'Вадим', 'Ильин', 3, 7000, None),
 (1, 'Иван', 'Иванов', 1, 5000, 'Moscow')]

In [7]:
# отсортровать по фаилили убывание  с зп меньше 5000
cursor.execute("select name, salary, surename from Employees where salary < 5000 order by surename desc")
cursor.fetchall()

[('Света', 4500, 'Сидорова'), ('Илья', 4500, 'Макаров')]

In [8]:
# обедиенения

In [9]:
# отсортровать по фаилили убывание  с зп меньше 5000
cursor.execute("select name, surename, department_id from Employees ")
cursor.fetchall()

[('Иван', 'Иванов', 1),
 ('Света', 'Сидорова', 1),
 ('Илья', 'Макаров', 2),
 ('Марина', 'Федорова', 2),
 ('Вадим', 'Ильин', 3),
 ('Илья', 'Филатов', 4)]

In [11]:
cursor.execute("""
select 
    Employees.name, Employees.surename, Departments.name
from 
    Employees 
    join Departments 
    on Employees.department_id = Departments.id
""")
cursor.fetchall()

[('Иван', 'Иванов', 'Маркетинг'),
 ('Света', 'Сидорова', 'Маркетинг'),
 ('Илья', 'Макаров', 'Продажи'),
 ('Марина', 'Федорова', 'Продажи'),
 ('Вадим', 'Ильин', 'Бухгалтерия')]

In [12]:
cursor.execute("insert into Departments(id) values(4)")
cursor.execute("insert into Departments(id) values(5)")

In [13]:
cursor.execute("""
select 
    Employees.name, Employees.surename, Departments.name
from 
    Departments
    join
    Employees 
    on Employees.department_id = Departments.id
""")
cursor.fetchall()

[('Иван', 'Иванов', 'Маркетинг'),
 ('Света', 'Сидорова', 'Маркетинг'),
 ('Илья', 'Макаров', 'Продажи'),
 ('Марина', 'Федорова', 'Продажи'),
 ('Вадим', 'Ильин', 'Бухгалтерия'),
 ('Илья', 'Филатов', None)]

In [17]:
cursor.execute("""
select 
    Employees.name, Employees.surename, Departments.name, Departments.id
from 
    Departments
    left join 
    Employees 
    on Employees.department_id = Departments.id
""")
cursor.fetchall()

[('Иван', 'Иванов', 'Маркетинг', 1),
 ('Света', 'Сидорова', 'Маркетинг', 1),
 ('Илья', 'Макаров', 'Продажи', 2),
 ('Марина', 'Федорова', 'Продажи', 2),
 ('Вадим', 'Ильин', 'Бухгалтерия', 3),
 ('Илья', 'Филатов', None, 4),
 (None, None, None, 5)]

In [19]:
cursor.execute("""
select 
    *
from 
    Departments
    join
    Employees 
""")
cursor.fetchall()

[(1, 'Маркетинг', 1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (1, 'Маркетинг', 2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (1, 'Маркетинг', 3, 'Илья', 'Макаров', 2, 4500, None),
 (1, 'Маркетинг', 4, 'Марина', 'Федорова', 2, 6000, None),
 (1, 'Маркетинг', 5, 'Вадим', 'Ильин', 3, 7000, None),
 (1, 'Маркетинг', 6, 'Илья', 'Филатов', 4, 5500, None),
 (2, 'Продажи', 1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (2, 'Продажи', 2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (2, 'Продажи', 3, 'Илья', 'Макаров', 2, 4500, None),
 (2, 'Продажи', 4, 'Марина', 'Федорова', 2, 6000, None),
 (2, 'Продажи', 5, 'Вадим', 'Ильин', 3, 7000, None),
 (2, 'Продажи', 6, 'Илья', 'Филатов', 4, 5500, None),
 (3, 'Бухгалтерия', 1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (3, 'Бухгалтерия', 2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (3, 'Бухгалтерия', 3, 'Илья', 'Макаров', 2, 4500, None),
 (3, 'Бухгалтерия', 4, 'Марина', 'Федорова', 2, 6000, None),
 (3, 'Бухгалтерия', 5, 'Вадим', 'Ильин', 3, 7000, None),
 (3, 'Бухгалтерия', 6, 'Илья', 'Филатов', 4, 5500, None),
 (4, None, 1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (4, None, 2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (4, None, 3, 'Илья', 'Макаров', 2, 4500, None),
 (4, None, 4, 'Марина', 'Федорова', 2, 6000, None),
 (4, None, 5, 'Вадим', 'Ильин', 3, 7000, None),
 (4, None, 6, 'Илья', 'Филатов', 4, 5500, None),
 (5, None, 1, 'Иван', 'Иванов', 1, 5000, 'Moscow'),
 (5, None, 2, 'Света', 'Сидорова', 1, 4500, 'Moscow1234567890Moscow'),
 (5, None, 3, 'Илья', 'Макаров', 2, 4500, None),
 (5, None, 4, 'Марина', 'Федорова', 2, 6000, None),
 (5, None, 5, 'Вадим', 'Ильин', 3, 7000, None),
 (5, None, 6, 'Илья', 'Филатов', 4, 5500, None)]

In [20]:
cursor.execute("""
select 
    Employees.name, Employees.surename, Departments.name
from 
    Departments
    join
    Employees 
    on Employees.department_id = Departments.id
""")
a = cursor.fetchall()

In [25]:
b = []
for k in a:
    b.append({
        'name': k[0],
        'sur': k[1],
    })

In [26]:
b

[{'name': 'Иван', 'sur': 'Иванов'},
 {'name': 'Света', 'sur': 'Сидорова'},
 {'name': 'Илья', 'sur': 'Макаров'},
 {'name': 'Марина', 'sur': 'Федорова'},
 {'name': 'Вадим', 'sur': 'Ильин'},
 {'name': 'Илья', 'sur': 'Филатов'}]

In [29]:
# посчитать сколько сотрудников получают ощниакоыую зрпаплату
cursor.execute("""
select 
    count(*), salary
from 
    Employees 
group by
    salary
""")
cursor.fetchall()

[(2, 4500), (1, 5000), (1, 5500), (1, 6000), (1, 7000)]

In [32]:
cursor.execute("""
select 
    max(salary), avg(salary), min(salary), name
from 
    Employees 
group by
    name
""")
cursor.fetchall()

[(7000, 7000.0, 7000, 'Вадим'),
 (5000, 5000.0, 5000, 'Иван'),
 (5500, 5000.0, 4500, 'Илья'),
 (6000, 6000.0, 6000, 'Марина'),
 (4500, 4500.0, 4500, 'Света')]